# АНАЛИЗ ДАННЫХ И ИСКУССТВЕННЫЙ ИНТЕЛЛЕКТ [in GameDev]
Отчет по лабораторной работе #1 выполнил(а):
- Темербаев Константин Валерьевич
- РИ230949

| Задание | Выполнение | Баллы |
| ------ | ------ | ------ |
| Задание 1 | * | 60 |
| Задание 2 | * | 20 |
| Задание 3 | * | 20 |

Работу проверили:



Структура отчета

- Данные о работе: название работы, фио, группа, выполненные задания.
- Цель работы.
- Задание 1.
- Код реализации выполнения задания. Визуализация результатов выполнения (если применимо).
- Задание 2.
- Код реализации выполнения задания. Визуализация результатов выполнения (если применимо).
- Задание 3.
- Код реализации выполнения задания. Визуализация результатов выполнения (если применимо).

## Цель работы
установить необходимое программное обеспечение, которое пригодится для создания интеллектуальных моделей на Python. Рассмотреть процесс установки игрового движка Unity для разработки игр.

## Задание 1
### Написать программу Hello World на Python с запуском в Jupiter Notebook.

```py

In [ ]:
print('Hello World')

Hello World

```




## Задание 2
###  Написать программу Hello World на C# с запуском на Unity. 

```c#

using System;
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class HelloWorld: MonoBehaviour
{
    // Start is called before the first frame update
    void Start()
    {
        Console.Write("Hello World");
        Debug.Log("Hello World");
    }

    // Update is called once per frame
    void Update()
    {
        
    }
}

```

## Задание 3
### Оформить отчет в виде документации на github.

https://github.com/TemKost/ADinGamedev

